---
kind: property
id: P:Autodesk.Revit.DB.Dimension.Name
zh: 尺寸标注、标注
source: html/4c4c2704-48d2-8add-8309-427ff77a8955.htm
---
# Autodesk.Revit.DB.Dimension.Name Property

**中文**: 尺寸标注、标注

Retrieves or changes the name associated with the Dimension.

## Syntax (C#)
```csharp
public string Name { get; set; }
```

## Remarks
The property inherited from element is hidden, a System.InvalidOperationException
is thrown.